#+TITLE: Emacs Configuration file
#+AUTHOR: Peng Li
#+EMAIL: seudut@gmail.com

** Scheme
Install =guile=, =guile= is an implementation of =Scheme= programming language.
#+BEGIN_SRC sh
  brew install guile
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :results silent
  (setq geiser-scheme-implementation 'guile)
#+END_SRC

#+BEGIN_SRC scheme
  (define a "3")
  a
#+END_SRC

#+RESULTS:
: 3

